<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"f19f0a3ad639b65c06945cb0e759da9c977ed311f74330dbc5c8cd1abf970614","plan_job_ref":"Job Plan Airflow DAGs #434 at https://github.com/cal-itp/data-infra/actions/runs/16756743645","plan_out_hash":"2e97791d5468aeeca243943a729d328ce543b7a5740ad7d898b71e959c965aed","plan_hash":"4edc574e5b4a1b32e85eb005a8bb4d1344eddab753f2bb32197e85a37e2e4744","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "wM2yXA==" -> (known after apply)
!~      detect_md5hash      = "mCWo8PMQ7vjslnkIfggP+Q==" -> "different hash"
!~      generation          = 1754321017159308 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "mCWo8PMQ7vjslnkIfggP+Q==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "IYUaLA==" -> (known after apply)
!~      detect_md5hash      = "H9zZ3dHqxcGtEMsx0vgleA==" -> "different hash"
!~      generation          = 1754321018638198 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "H9zZ3dHqxcGtEMsx0vgleA==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #434](https://github.com/cal-itp/data-infra/actions/runs/16756743645)